renesas/rx-driver-package/source/r_qspi_smstr_rx/r_qspi_smstr_rx_vx.xx/r_qspi_smstr_rx/src/targets/rx72n/r_qspi_smstr_target.c
/*******************************************************************************
* DISCLAIMER
* This software is supplied by Renesas Electronics Corporation and is only
* intended for use with Renesas products. No other uses are authorized. This
* software is owned by Renesas Electronics Corporation and is protected under
* all applicable laws, including copyright laws.
* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
* THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT
* LIMITED TO WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE
* AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED.
* TO THE MAXIMUM EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS
* ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES SHALL BE LIABLE
* FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR
* ANY REASON RELATED TO THIS SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE
* BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
* Renesas reserves the right, without notice, to make changes to this software
* and to discontinue the availability of this software. By using this software,
* you agree to the additional terms and conditions found by accessing the
* following link:
* http://www.renesas.com/disclaimer
*
* Copyright (C) 2019 Renesas Electronics Corporation. All rights reserved.
*******************************************************************************/
/*******************************************************************************
* System Name  : QSPI single master driver
* File Name    : r_qspi_smstr_target.c
* Version      : 1.14
* Device       : RX
* Abstract     : Main processing source file for QSPI single master driver
* Tool-Chain   : Renesas RXC Toolchain v3.01.00
* OS           : not use
* H/W Platform : not use
* Description  : Functions for QSPI single master driver
* Limitation   : none
*******************************************************************************/
/*******************************************************************************
* History      : DD.MM.YYYY Version  Description
*              : 22.11.2019 1.14     First Release
*******************************************************************************/

/*******************************************************************************
Includes <System Includes> , "Project Includes"
*******************************************************************************/
/* Public interface header file for this package. */
#include "r_qspi_smstr_rx_if.h"
/* Configuration for this package. */
#include "r_qspi_smstr_rx_config.h"
/* Private header file for this package. */
#include "./src/r_qspi_smstr_private.h"

/* Check MCU Group */
#if defined(BSP_MCU_RX72N)


/*******************************************************************************
Macro definitions
*******************************************************************************/
/* ---- Definitions of mask data for I/O registers. ---- */
/* Casting the macro definitions to uint16_t type is valid. 
   Because match the type of the processing. */
#define SPCMD_MASK_CLK_MODE     (uint16_t)(0x0003)  /* SPI clock mode of SPCMD.             */

/* ---- Definitions of value of transmit data length. ---- */
/* Casting the macro definitions to uint8_t type is valid. 
   Because match the type of the processing. */
#define SPCMD_SPB_LONG          (uint8_t)(2)        /* Transfer data length : 32 bits       */
#define SPCMD_SPB_BYTE          (uint8_t)(0)        /* Transfer data length :  8 bits       */

/* ---- Definition to check data size. ---- */
/* Casting the macro definitions to uint32_t type is valid. 
   Because match the type of the processing. */
#define QSPI_FIFO_CHK           (uint32_t)(0x000f)

/*******************************************************************************
Private variables and functions
*******************************************************************************/
static void r_qspi_smstr_spsr_clear(uint8_t channel);
static void r_qspi_smstr_buffer_reset(uint8_t channel);
static void r_qspi_smstr_datasize_set(uint8_t channel, uint32_t size);

/* Array of address of SPSR. */
static volatile uint8_t R_BSP_EVENACCESS_SFR * g_qspi_spsr[] =
{
#if (1 == QSPI_NUM_CHANNELS)
    &(QSPI.SPSR.BYTE),
#endif
};

/* Array of base address of I/O registers of QSPI. */
static volatile struct st_qspi R_BSP_EVENACCESS_SFR * g_qspi_base_adr[] =
{
#if (1 == QSPI_NUM_CHANNELS)
    &QSPI
#endif
};


/*******************************************************************************
* Function Name: r_qspi_smstr_ch_check
* Description  : Checks whether channel is valid or not.
* Arguments    : channel -
*                    Which channel to use
* Return Value : QSPI_SMSTR_SUCCESS -
*                    The channel is valid.
*                QSPI_SMSTR_ERR_PARAM -
*                    Parameter error
*******************************************************************************/
qspi_smstr_status_t r_qspi_smstr_ch_check(uint8_t channel)
{
    qspi_smstr_status_t ret = QSPI_SMSTR_SUCCESS;
    
    switch (channel)
    {
        case 0:
#if defined(QSPI_SMSTR_CFG_CH0_INCLUDED)
            /* Do nothing */
#else
            /* QSPI channel 0 is invalid. */
            ret = QSPI_SMSTR_ERR_PARAM;
#endif
        break;
        
        default:
            /* The channel number is invalid. */
            ret = QSPI_SMSTR_ERR_PARAM;
        break;
    }
    
    return ret;
}


/*******************************************************************************
* Function Name: r_qspi_smstr_enable
* Description  : Enables QSPI and initializes registers.
* Arguments    : channel -
*                    Which channel to use
*                br_data -
*                    Setting of QSPI Bit Rate Register (SPBR)
* Return Value : none
*******************************************************************************/
void r_qspi_smstr_enable(uint8_t channel, uint8_t br_data)
{
    r_qspi_smstr_module_enable(channel);            /* Cancel the Module Stop of QSPI.  */
    QSPI_SPCR(channel)      = QSPI_SPCR_INIT;
                                        /* Disable QSPI function and set master mode.   */
    if (QSPI_SPCR_INIT == QSPI_SPCR(channel))
    {
        /* Wait for the write completion. */
        R_BSP_NOP();
    }
    QSPI_SSLP(channel)      = QSPI_SSLP_INIT;       /* Initialize SSLP.                 */
    QSPI_SPPCR(channel)     = QSPI_SPPCR_INIT;      /* Initialize SPPCR.                */
    QSPI_SPBR(channel)      = br_data;              /* Set bit rate.                    */
    QSPI_SPCKD(channel)     = QSPI_SPCKD_INIT;      /* Initialize SPCKD.                */
    QSPI_SSLND(channel)     = QSPI_SSLND_INIT;      /* Initialize SSLND.                */
    QSPI_SPND(channel)      = QSPI_SPND_INIT;       /* Initialize SPND.                 */
    QSPI_SPDCR(channel)     = QSPI_SPDCR_INIT;      /* Initialize SPDCR.                */
    r_qspi_smstr_spsr_clear(channel);               /* Clear status flag of QSPI.       */
    QSPI_SPSCR(channel)     = QSPI_SPSCR_INIT;      /* Initialize SPSCR.                */
    QSPI_SPBFCR(channel)    = QSPI_SPBFCR_INIT;     /* Initialize SPBFCR.               */
    if (QSPI_SPBFCR_INIT == QSPI_SPBFCR(channel))
    {
        /* According to specifications of QSPI,
           if write SPBFCR, must execute dummy reading. */
        /* Wait for the write completion. */
        R_BSP_NOP();
    }
    QSPI_SPCMD0(channel)    = QSPI_SPCMD_INIT;      /* Initialize SPCMD0.               */
    QSPI_SPCMD1(channel)    = QSPI_SPCMD_INIT;      /* Initialize SPCMD1.               */
    QSPI_SPCMD2(channel)    = QSPI_SPCMD_INIT;      /* Initialize SPCMD2.               */
    if (QSPI_SPCMD_INIT  == QSPI_SPCMD2(channel))
    {
        /* Wait for the write completion. */
        R_BSP_NOP();
    }
}


